## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 33 to add, 0 to change, 33 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                  |
|----------|--------------------------------------------------------------------------------------------------------|
| add      | `module.ai_answers_vpc.aws_cloudwatch_log_group.flow_logs[0]`                                          |
|          | `module.ai_answers_vpc.aws_default_network_acl.default`                                                |
|          | `module.ai_answers_vpc.aws_default_route_table.default`                                                |
|          | `module.ai_answers_vpc.aws_default_security_group.default`                                             |
|          | `module.ai_answers_vpc.aws_eip.nat[0]`                                                                 |
|          | `module.ai_answers_vpc.aws_flow_log.flow_logs[0]`                                                      |
|          | `module.ai_answers_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]`                           |
|          | `module.ai_answers_vpc.aws_iam_role.flow_logs[0]`                                                      |
|          | `module.ai_answers_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0]`    |
|          | `module.ai_answers_vpc.aws_internet_gateway.gw`                                                        |
|          | `module.ai_answers_vpc.aws_nat_gateway.nat_gw[0]`                                                      |
|          | `module.ai_answers_vpc.aws_network_acl.main`                                                           |
|          | `module.ai_answers_vpc.aws_network_acl_rule.block_rdp[0]`                                              |
|          | `module.ai_answers_vpc.aws_network_acl_rule.block_ssh[0]`                                              |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_egress_443[0]`                               |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_in_ingress_443[0]`                           |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0]`                     |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_in_response_egress_443[0]`                   |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0]`             |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0]`                     |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0]`                 |
|          | `module.ai_answers_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0]`           |
|          | `module.ai_answers_vpc.aws_route.private_nat_gateway[0]`                                               |
|          | `module.ai_answers_vpc.aws_route.public_internet_gateway`                                              |
|          | `module.ai_answers_vpc.aws_route_table.private[0]`                                                     |
|          | `module.ai_answers_vpc.aws_route_table.public`                                                         |
|          | `module.ai_answers_vpc.aws_route_table_association.private[0]`                                         |
|          | `module.ai_answers_vpc.aws_route_table_association.public[0]`                                          |
|          | `module.ai_answers_vpc.aws_subnet.private[0]`                                                          |
|          | `module.ai_answers_vpc.aws_subnet.public[0]`                                                           |
|          | `module.ai_answers_vpc.aws_vpc.main`                                                                   |
| delete   | `module.react_answers_vpc.aws_cloudwatch_log_group.flow_logs[0]`                                       |
|          | `module.react_answers_vpc.aws_default_network_acl.default`                                             |
|          | `module.react_answers_vpc.aws_default_route_table.default`                                             |
|          | `module.react_answers_vpc.aws_default_security_group.default`                                          |
|          | `module.react_answers_vpc.aws_eip.nat[0]`                                                              |
|          | `module.react_answers_vpc.aws_flow_log.flow_logs[0]`                                                   |
|          | `module.react_answers_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]`                        |
|          | `module.react_answers_vpc.aws_iam_role.flow_logs[0]`                                                   |
|          | `module.react_answers_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0]` |
|          | `module.react_answers_vpc.aws_internet_gateway.gw`                                                     |
|          | `module.react_answers_vpc.aws_nat_gateway.nat_gw[0]`                                                   |
|          | `module.react_answers_vpc.aws_network_acl.main`                                                        |
|          | `module.react_answers_vpc.aws_network_acl_rule.block_rdp[0]`                                           |
|          | `module.react_answers_vpc.aws_network_acl_rule.block_ssh[0]`                                           |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_egress_443[0]`                            |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_in_ingress_443[0]`                        |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0]`                  |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_in_response_egress_443[0]`                |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0]`          |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0]`                  |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0]`              |
|          | `module.react_answers_vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0]`        |
|          | `module.react_answers_vpc.aws_route.private_nat_gateway[0]`                                            |
|          | `module.react_answers_vpc.aws_route.public_internet_gateway`                                           |
|          | `module.react_answers_vpc.aws_route_table.private[0]`                                                  |
|          | `module.react_answers_vpc.aws_route_table.public`                                                      |
|          | `module.react_answers_vpc.aws_route_table_association.private[0]`                                      |
|          | `module.react_answers_vpc.aws_route_table_association.public[0]`                                       |
|          | `module.react_answers_vpc.aws_subnet.private[0]`                                                       |
|          | `module.react_answers_vpc.aws_subnet.public[0]`                                                        |
|          | `module.react_answers_vpc.aws_vpc.main`                                                                |
| recreate | `aws_security_group.app`                                                                               |
|          | `aws_security_group_rule.app_egress_https`                                                             |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/ai-answers/actions/runs/13158526063).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  - destroy
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ destroy and then create replacement
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= read (data resources)
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group.app must be replaced
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_security_group" "app" {
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                    = "arn:aws:ec2:ca-central-1:992382783569:security-group/sg-05127be6835fe87dd" -> (known after apply)
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ egress                 = [
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - {
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - cidr_blocks      = [
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  - "0.0.0.0/0",
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - description      = "Allow HTTPS (TCP 443) egress to the internet"
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - from_port        = 443
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - ipv6_cidr_blocks = []
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - prefix_list_ids  = []
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - protocol         = "tcp"
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - security_groups  = []
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - self             = false
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - to_port          = 443
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ] -> (known after apply)
[0;90m13:33:15.018[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                     = "sg-05127be6835fe87dd" -> (known after apply)
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ ingress                = [] -> (known after apply)
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ name                   = "react-answers_app_sg" -> "ai-answers_app_sg" # forces replacement
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = (known after apply)
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id               = "992382783569" -> (known after apply)
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags                   = {
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          ~ "CostCentre" = "react-answers-staging" -> "ai-answers-staging"
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          ~ "Name"       = "react-answers_app_sg" -> "ai-answers_app_sg"
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all               = {
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          ~ "CostCentre" = "react-answers-staging" -> "ai-answers-staging"
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          ~ "Name"       = "react-answers_app_sg" -> "ai-answers_app_sg"
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                 = "vpc-0b3b4d18b4a4a0f63" -> (known after apply) # forces replacement
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (2 unchanged attributes hidden)
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group_rule.app_egress_https must be replaced
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_security_group_rule" "app_egress_https" {
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                       = "sgrule-2993565157" -> (known after apply)
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ security_group_id        = "sg-05127be6835fe87dd" -> (known after apply) # forces replacement
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ security_group_rule_id   = "sgr-0bbd6ec5978da90d2" -> (known after apply)
[0;90m13:33:15.019[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_security_group_id = (known after apply)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (7 unchanged attributes hidden)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.data.aws_iam_policy_document.vpc_metrics_flow_logs_write[0] will be read during apply
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (config refers to values not yet known)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write" {
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id            = (known after apply)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + json          = (known after apply)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + minified_json = (known after apply)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + statement {
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + actions   = [
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:CreateLogStream",
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:DescribeLogGroups",
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:DescribeLogStreams",
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:PutLogEvents",
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + effect    = "Allow"
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + resources = [
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + (known after apply),
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + (known after apply),
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_cloudwatch_log_group.flow_logs[0] will be created
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_group" "flow_logs" {
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn               = (known after apply)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                = (known after apply)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_class   = (known after apply)
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name              = "ai-answers_flow_logs"
[0;90m13:33:15.020[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix       = (known after apply)
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + retention_in_days = 30
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy      = false
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags              = {
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all          = {
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_default_network_acl.default will be created
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_default_network_acl" "default" {
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_network_acl_id = (known after apply)
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_default_nacl"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_default_nacl"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = (known after apply)
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.021[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_default_route_table.default will be created
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_default_route_table" "default" {
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_route_table_id = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route                  = []
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "name"       = "ai-answers_default_route_table"
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "name"       = "ai-answers_default_route_table"
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_default_security_group.default will be created
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_default_security_group" "default" {
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress                 = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m13:33:15.022[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress                = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                   = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revoke_rules_on_delete = false
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_default_sg"
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_default_sg"
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_eip.nat[0] will be created
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_eip" "nat" {
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + allocation_id        = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                  = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + association_id       = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + carrier_ip           = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + customer_owned_ip    = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + domain               = "vpc"
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                   = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance             = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipam_pool_id         = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_border_group = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface    = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns          = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_ip           = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ptr_record           = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_dns           = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_ip            = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_ipv4_pool     = (known after apply)
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                 = {
[0;90m13:33:15.023[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers-eip0"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all             = {
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers-eip0"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc                  = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_flow_log.flow_logs[0] will be created
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_flow_log" "flow_logs" {
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                      = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + iam_role_arn             = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                       = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_destination          = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_destination_type     = "cloud-watch-logs"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_format               = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_name           = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + max_aggregation_interval = 600
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                     = {
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                 = {
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + traffic_type             = "ALL"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                   = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0] will be created
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_policy" "vpc_metrics_flow_logs_write_policy" {
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn              = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + attachment_count = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description      = "IAM policy for writing flow logs in CloudWatch"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id               = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name             = "VpcMetricsFlowLogsWrite"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix      = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path             = "/"
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy           = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_id        = (known after apply)
[0;90m13:33:15.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags             = {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all         = {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_iam_role.flow_logs[0] will be created
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role" "flow_logs" {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                   = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assume_role_policy    = jsonencode(
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action    = "sts:AssumeRole"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect    = "Allow"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Principal = {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Service = "vpc-flow-logs.amazonaws.com"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + create_date           = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_detach_policies = false
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                    = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + managed_policy_arns   = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + max_session_duration  = 3600
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                  = "ai-answers_flow_logs"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix           = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path                  = "/"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                  = {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all              = {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + unique_id             = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + inline_policy (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0] will be created
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy_attachment" "vpc_metrics_flow_logs_write_policy_attach" {
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id         = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_arn = (known after apply)
[0;90m13:33:15.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role       = "ai-answers_flow_logs"
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_internet_gateway.gw will be created
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_internet_gateway" "gw" {
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn      = (known after apply)
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id       = (known after apply)
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id = (known after apply)
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags     = {
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_internet_gateway"
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all = {
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"       = "ai-answers_internet_gateway"
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id   = (known after apply)
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers_vpc.aws_nat_gateway.nat_gw[0] will be created
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_nat_gateway" "nat_gw" {
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + allocation_id                      = (known after apply)
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + association_id                     = (known after apply)
[0;90m13:33:15.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + connectivity_type                  =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.app"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
